* chapter1
** 06
   - set 型に対する演算
	 - add() : 要素の追加
	 - discard() : 要素の削除
	 - |, &, - : それぞれ和，積，差集合
** 08
   - 文字コード -> 文字 : chr()
   - 文字 -> 文字コード : ord()
	 #+begin_src python :results output
	   a = 'a'
	   ord_a = ord(a)
	   print(ord_a)
	   print(chr(ord_a))
	   #+end_src

#+RESULTS:
: 97
: a

** 09
   - スライスを使って Index Error を回避
	 #+begin_src python :results output
	   a = ''
	   print(a[1:])
	   try:
		   print(a[1])
	   except IndexError:
		   print('Index Error')
	 #+end_src

	 #+RESULTS:
	 : 
	 : Index Error
* chapter2
** 11
   - expand コマンド
	 - タブを8文字のスペース置換
	 - -t オプションでスペース何個に置換するかを指定
	   #+begin_src sh :results output
		 cat popular-names.txt | expand -t 1 | head -n 5
	   #+end_src

	   #+RESULTS:
	   : Mary F 7065 1880
	   : Anna F 2604 1880
	   : Emma F 2003 1880
	   : Elizabeth F 1939 1880
	   : Minnie F 1746 1880

** 12
   - cut コマンド
	 - タブやコンマで区切られたファイルの N 行目を出力する
	 
	   #+begin_src sh
		 cut -f 1 ./popular-names.txt | head -n 5
	   #+end_src

	   #+RESULTS:
	   | Mary      |
	   | Anna      |
	   | Emma      |
	   | Elizabeth |
	   | Minnie    |

   - -d オプションなどでデリミタを指定できる

** 13
   - paste コマンド
	 - ファイルをタブなどのデリミタで結合
	   #+begin_src sh :results output
		 paste col1.txt col2.txt | head -n 5
	   #+end_src

	   #+RESULTS:
	   : Mary	F
	   : Anna	F
	   : Emma	F
	   : Elizabeth	F
	   : Minnie	F
